ci4/app/Controllers/User.php

SELECT *
FROM `user`
WHERE `useremail` = 'admin@email.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);

        // Check if this is a POST request (form submission)
        if ($this->request->getMethod() !== 'POST') {
            return view('user/login');
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $session = session();
        $model = new UserModel();

        $user = $model->where('useremail', $email)->first();